of40/tutorials/rheoFoam/CrossSlot/sPTTLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

   
    inlet_north
    {
        type            fixedValue;
        value           uniform (0 -1 0);
    }
    
    inlet_south
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }

    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet_west
    {
        type            zeroGradient;
    }

    outlet_east
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
  
    
    
}

// ************************************************************************* //
